Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of the Nāga King Sāgara

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ། དགེ་སློང་བརྒྱད་སྟོང་གི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པ།
en: The Blessed One was dwelling in Rājagṛha at Vulture Peak Mountain with a great saṅgha of eight thousand monks and with twelve thousand bodhisattvas with higher knowledge that had gathered from the worlds of the ten directions by means of their higher knowledge.

source: རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ།
en: Those bodhisattvas possessed all the greatest attributes.

source: གཟུངས་དང་མདོ་སྡེ་རྟོགས་པར་ཁོང་དུ་ཆུད་པ།
en: They knew the dhāraṇīs and the discourses.

source: སེམས་ཅན་ཐམས་ཅད་སྤོབས་པས་མགུ་བར་བྱེད་པ།
en: They delighted all beings with their eloquence.

source: མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in teaching the wisdom of the higher knowledges.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: They had traveled to the sublime far shore of all the perfections.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་དང་ལྡན་པ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of the bodhisattvas’ absorptions and attainments.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་ཅིང་བསྔགས་ལ་སྙན་པར་བརྗོད་པ།
en: They were praised, commended, and lauded by all buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རྫུ་འཕྲུལ་གྱིས་འགྲོ་བ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of traveling to all buddha realms through their miraculous powers.

source: བདུད་ཐམས་ཅད་སྐྲག་པར་བྱ་བ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of terrifying the māras.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of all phenomena just as they are.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of beings’ supreme and ordinary faculties.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྒྲུབ་པ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of accomplishing the factors of awakening.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཆོད་པའི་ལས་ཡང་དག་པར་སྒྲུབ་པ་ཤེས་པ་ལ་མཁས་པ།
en: They were skilled in the knowledge of correctly accomplishing the acts of venerating all the buddhas.

source: འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མ་གོས་པ། ལུས་དང་ངག་དང་སེམས་ཀྱི་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: They were unstained by any worldly phenomena and were adorned with all the ornaments of body, speech, and mind.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་སྤྲོ་བའི་གོ་ཆ་བགོས་པ།
en: They had donned the armor consisting of delight in great love and compassion.

source: བསྐལ་པ་གྲངས་མེད་པར་བརྩོན་འགྲུས་ཆེན་པོས་ཡིད་ཡོངས་སུ་མི་སྐྱོ་བ།
en: They could be diligent over the course of countless eons without becoming discouraged.

source: སེང་གེའི་སྒྲ་ཆེན་པོ་བསྒྲགས་པ།
en: They roared the great lion’s roar.

source: ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པ།
en: They were not overcome by any of the arguments of their adversaries.

source: ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་ཕྱག་རྒྱས་བཏབ་པ།
en: They had been marked by the seal of the irreversible Dharma.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱིས་དབང་བསྐུར་བ་ཐོབ་པ་ཁྲི་ཉིས་སྟོང་ལ་འདི་ལྟ་སྟེ།
en: They had been crowned with all the qualities of buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷུན་པོ་དང་། རི་རབ་དང་། ལྷུན་པོ་ཆེན་པོ་དང་། ལྷུན་པོའི་རྩེ་འཛིན་དང་། ལྷུན་པོ་མར་མེའི་རྒྱལ་པོ་དང་། ལྷུན་པོ་བརྩེགས་པ་དང་། ལྷུན་པོའི་རྒྱལ་མཚན་དང་། ལྷུན་པོའི་རྒྱལ་པོ་དང་། ལྷུན་པོའི་རྩེ་མོ་རྡོབ་པའི་རྒྱལ་པོ་དང་། འབྲུག་སྒྲ་དང་། རྔ་སྒྲ་དང་། རིན་ཆེན་འབྱུང་གནས་དང་། རིན་ཆེན་ཏོག་དང་། རིན་ཆེན་རྩེ་མོ་དང་། རིན་ཆེན་དཔལ་དང་། རིན་ཆེན་འབྱུང་དང་། རིན་ཆེན་འོད་དང་། རིན་ཆེན་ཁར་བ་ཅན་དང་། རིན་ཆེན་རྩེ་མོ་དང་། ལག་ན་རིན་ཆེན་ཕྱག་རྒྱ་དང་། རིན་ཆེན་དྲ་བ་དང་། རིན་ཆེན་བཀོད་པ་དང་། རིན་ཆེན་འོད་དང་། རིན་ཆེན་གླིང་དང་། རིན་ཆེན་སྒྲོན་མ་དང་། ལག་ན་རིན་ཆེན་དང་། དགའ་བྱེད་དང་། ཆོས་ལ་དགའ་བ་བཀོད་པ་དང་། བཀོད་པའི་རྒྱལ་པོ་དང་། མཚན་གྱིས་ཡང་དག་པར་བརྒྱན་པ་དང་། ཚིག་བཀོད་པའི་འོད་དང་། ཚིག་རྣམ་པར་དག་པའི་འོད་དང་། གཙུག་ན་རིན་པོ་ཆེ་དང་། ལྷ་བརྩེགས་དང་། རིན་ཆེན་བརྩེགས་དང་། འོད་ཟེར་སྟོང་ལྡན་དང་། མེ་ལྕེ་དང་། སྐར་མ་ལ་དགའ་བ་དང་། ཟླ་འོད་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། གསེར་བཟངས་རྣམ་དག་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མི་འཇིགས་པ་སྦྱིན་པ་དང་། བྱམས་པ་ལ་སོགས་པ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། འཇམ་དཔལ་ལ་སོགས་པ་སེམས་དཔའ་དཔེ་མེད་པ་དྲུག་ཅུ་དང་། བཟང་སྐྱོང་ལ་སོགས་པ་སྐྱེས་བུ་དམ་པ་བཅུ་དྲུག་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སོགས་པ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་རབ་འཐབ་བྲལ་ལ་སོགས་པ་འཐབ་བྲལ་བའི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་ཡོངས་སུ་དགའ་ལྡན་ལ་སོགས་པ་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའ་ལ་སོགས་པ་འཕྲུལ་དགའི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་དབང་བྱེད་ལ་སོགས་པ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། ལྷའི་བུ་དེད་དཔོན་ལ་སོགས་པ་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་དཀར་པོའི་ཕྱོགས་ཐམས་ཅད་དང་། རབ་ཚངས་པ་ལ་སོགས་པ་ཚངས་པའི་མདུན་ན་འདོན་པའི་ལྷ་རྣམས་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ལ་སོགས་པ་ཚངས་ཆེན་གྱི་རིས་ཀྱི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་འོད་གསལ་ལ་སོགས་པ་འོད་གསལ་གྱི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་དགེ་རྒྱས་ལ་སོགས་པ་དགེ་རྒྱས་ཀྱི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་འབྲས་བུ་ཆེ་ལ་སོགས་པ་འབྲས་བུ་ཆེ་བའི་ལྷ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་། ལྷའི་རྒྱལ་པོ་དྲི་མེད་འོད་ལ་སོགས་པ་འོག་མིན་གྱི་ལྷའི་བུ་རྣམས་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་ལ་སོགས་པ་ལྷ་མ་ཡིན་གྱི་དབང་པོ་དྲུག་ཁྲི་དང་། མིའམ་ཅིའི་རྒྱལ་པོ་ལྗོན་པ་ལ་སོགས་པ་མིའམ་ཅིའི་རྒྱལ་པོ་བཞི་ཁྲི་ཉིས་སྟོང་དང་། དྲི་ཟའི་རྒྱལ་པོ་ཕྲེང་ཐོགས་ལ་སོགས་པ་དྲི་ཟའི་རྒྱལ་པོ་སུམ་ཁྲི་ཉིས་སྟོང་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་བདུན་ཁྲི་ཉིས་སྟོང་དང་། བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་བཞི་སྟོང་དང་། དེ་མ་ཡིན་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་སྟོང་དག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: They included the bodhisattva great beings Meru, Sumeru , Mahāmeru, Scaling the Peak of Meru, King of the Meru Lamp, Merukūṭa, Merudhvaja, Merurāja, King Who Rules the Peak of Meru, Thunder , Drumbeat, Ratnākara, Ratnaketu , Jewel Peak, Ratnaśrī, Ratnasambhava, Ratnaprabha, Jeweled Staff Holder, Jewel Peak, Holder of the Precious Seal, Ratnajāla, Ratnavyūha, Ratnaprabha, Ratnadvīpa, Ratnadīpa, Ratnapāṇi, Nanda , Inspiring Love for the Dharma, Vyūharāja, Adorned with a Mark, Light That Creates Language, Pure Light of Language, Ratnacūḍa, Amassed Divinity, Ratnakūṭa, Sahasraraśmi, Agnijihva, Star Lover, Candra­prabha, Saha­cittotpāda­dharma­cakra­pravartin, and Pure Golden Light, and the bodhisattva great being Eternal Giver of Freedom from Fear. They also included all the bodhisattva great beings of the Fortunate Eon such as Maitreya, sixty incomparable bodhisattvas such as Mañjuśrī, and sixteen excellent men such as Bhadrapāla. Also present there were classes of gods including the Four Great Kings, the gods of the Thirty-Three such as the divine ruler Śakra, the gods of the Heaven Free from Strife such as the divine king Suyāma, the gods of the Heaven of Joy such as the divine king Saṃtuṣita, the gods of the Heaven of Delighting in Emanations such as the divine king Sunirmāṇarati, the gods of the Heaven of Making Use of Others’ Emanations such as the divine king Vaśavartin, the māra gods such as the god Sārthavāha, the gods of the High Priests of the Brahmā Realm such as Subrahmā, the gods of the Great Brahmā class such as Brahmā who is lord of the Sahā world, the gods of the Luminous Heaven such as the divine king Ābhāsvara, the gods of the Heaven of Perfected Virtue such as the divine king Śubhakṛtsna, the gods of the Heaven of Great Fruition such as the divine king Bṛhatphala, the gods of the Pure Land such as the divine king Maheśvara, the gods of the Highest Heaven such as the divine king Vimalaprabhāsa, sixty thousand lords of the asuras such as the lord of the asuras Rāhu, forty-two thousand kinnaras such as the lord of the kinnaras Druma, thirty-two thousand lords of the gandharvas such as the lord of the gandharvas Mālādhara, seventy-two thousand nāga lords such as the king of the nāgas Anavatapta, and four thousand garuḍas who rule the birds, as well as thousands of other majestic gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ཏེ་ཆོས་སྟོན་ཅིང་།
en: Surrounded and revered by these thousands of members of the assembly, the Blessed One gazed straight ahead as he taught the Dharma.

source: ལྷ་ཐམས་ཅད་ཀྱི་བཀོད་པས་ལེགས་པར་བརྒྱན་པའི་སེང་གེའི་ཁྲི་ལ་རིའི་རྒྱལ་པོ་རི་རབ་རྒྱ་མཚོའི་ནང་ནས་གྱེན་དུ་འཕགས་པ་བཞིན་དུ་བཞུགས་ཏེ།
en: He sat upon a richly adorned lion throne, which had been arranged by all the gods, in such a manner that he resembled Mount Meru, the king of mountains rising above the ocean.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ནས་དགེ་སློང་གི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེ་ཞིང་བཞུགས་སོ།
en: Outshining the world and its gods, the Blessed One was dazzling, radiant, and brilliant as he sat there surrounded by the assembly of monks.

source: །དེ་ནས་དེ་ལྟར་འདུས་པའི་འཁོར་དེའི་ནང་ན་དེ་བཞིན་གཤེགས་པ་དེ་ལྟར་བཞུགས་པའི་སྟེང་གི་བར་སྣང་ལ་རིན་པོ་ཆེའི་གདུགས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་དང་ལྡན་ཞིང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ་ཞིག་བྱུང་སྟེ།
en: Then a jeweled parasol set with all lustrous gems and richly adorned with all kinds of jewels appeared in the sky above the Blessed One, who was seated amidst the gathered assembly.

source: རིན་པོ་ཆེའི་གདུགས་དེས་ཐམས་ཅད་དང་ལྡན་པའི་གླིང་བཞི་པ་ཆེན་པོའི་འཇིག་རྟེན་འདི་ཀུན་ཏུ་ཁེབས་པར་གྱུར་ཏོ།
en: The jeweled parasol covered the entirety of this four-continent world system.

source: །རིན་པོ་ཆེའི་གདུགས་དེ་ལས་ཀྱང་མུ་ཏིག་ཁ་དོག་དུ་མའི་རྒྱན་ཕྲེང་འབུམ་ཕྲག་དུ་མ་འདི་ལྟ་སྟེ། མུ་ཏིག་དཀར་པོ་དང་། མུ་ཏིག་དམར་པོ་དང་། མུ་ཏིག་དྲི་མ་མེད་པ་དང་། གསེར་ལྟ་བུའི་མུ་ཏིག་དང་། ཟླ་བ་ལྟ་བུའི་མུ་ཏིག་དང་། པད་མ་ལྟ་བུའི་མུ་ཏིག་དང་། ནམ་མཁའ་ལྟ་བུའི་མདོག་ཅན་གྱི་མུ་ཏིག་རྣམས་འཕྱང་ངོ་། །མུ་ཏིག་གི་རྒྱན་ཕྲེང་དེ་དག་ལས་ཀྱང་འོད་ཟེར་དག་བྱུང་ངོ་།
en: Hanging from it were hundreds of thousands of strands of multicolored pearls including white, red, crystal, golden, moon-colored, lotus-colored, and sky-colored pearls.

source: །འོད་ཟེར་དེ་དག་ལས་ཀྱང་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་པ།
en: As the strands of pearls glowed with light, a rain of flowers fell from the light rays.

source: ཁ་དོག་འབུམ་ཕྲག་དུ་མ་དྲི་ཞིམ་པ། བལྟ་ན་སྡུག་པ་ཡིད་དུ་འོང་བ་དག་གི་ཆར་མངོན་པར་བབ་བོ།
en: The flowers had hundreds of thousands of hues and were fragrant, beautiful, and captivating.

source: །མེ་ཏོག་དེ་དག་གིས་ཀྱང་འཁོར་གྱི་ཁྱམས་ཐམས་ཅད་པུས་མོ་ནུབ་པ་ཙམ་དུ་གང་བར་གྱུར་ཏོ།
en: They rained down over everyone in the assembly until they covered their knees.

source: །བར་སྣང་ལ་ཡང་འབྲུག་སྒྲ་ཆེན་པོ་གྲགས་པར་གྱུར་ཏོ།
en: Thunder cracked in the sky.

source: །ཨ་ག་རུ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དག་དང་། ཙན་དན་དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཕྱེ་མ་དག་གི་ཆར་ཡང་བབ་བོ།
en: A rain of powdered aloe, red sandalwood, and yellow sandalwood also fell.

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: Then through the power of the Buddha, Venerable Mahāmaudgalyāyana stood up, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སྔོན་མ་མཐོང་མ་ཐོས་པའི་ཆོ་འཕྲུལ་འདི་ལྟ་བུ་གདའ་བ་འདི་དག་སུའི་སྔ་ལྟས་ལགས།
en: With his palms together, he bowed toward the Blessed One and asked, “Blessed One, whose arrival does such a miracle—never seen or heard of before—portend?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །མཽད་གལ་གྱི་བུ་འདི་ནི་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དེ་བཞིན་གཤེགས་པ་ལ་བལྟར་འོང་བ་དེའི་སྔ་ལྟས་ཡིན་ནོ།
en: The Blessed One answered Venerable Mahāmaudgalyāyana, “Maudgalyāyana, this portends that Nāga King Sāgara is coming to see the Thus-Gone One.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིག་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་རིང་པོ་མ་ལོན་པར། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ཀླུ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་དང་། ཀླུའི་བུ་མོ་བྱེ་བ་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་ཀྱིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: Before long, Nāga King Sāgara arrived, surrounded and venerated by 840 million male and 720 million female nāgas.

source: མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐམས་ཅད་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་བརྒྱ་སྟོང་དག་ལེན་ཅིང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: They came toward the Blessed One bearing flowers, fragrances, incense, flower garlands, lotions, powders, clothing, parasols, banners, and pennants. They were playing instruments, chanting, and singing thousands of melodies.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཇི་ལྟར་ཐོགས་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་ལ་སོགས་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ལ་སོགས་པ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་དང་། གླུ་དབྱངས་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ནས།
en: They bowed to the feet of the Blessed One and venerated him with their flowers, fragrances, incense, flower garlands, lotions, powders, clothing, parasols, banners, pennants, instruments, and singing.

source: བཙུན་མོའི་འཁོར་དང་བཅས་པ་དང་། གཉེན་འདབ་ཀྱི་འཁོར་དང་བཅས་པས་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: At this point, he and his retinue of queens and relatives praised the Blessed One with these fitting verses:

source: །འཇིག་རྟེན་དག་ན་འཇིག་རྟེན་ཕན་པར་བཞེད་པ་འཇིག་རྟེན་གྱིས་མཆོད་འཇིག་རྟེན་མིག་སྦྱིན་པ།
en: “You work to benefit the world, you are honored by the world, and you give sight to the world.

source: །འཇིག་རྟེན་དུ་སྐྱེས་འཇིག་རྟེན་དྲི་མ་རྣམས་ཀྱིས་མ་གོས་པད་མ་ཆུས་མི་ཆགས་པ་བཞིན།
en: Though born in this world, you are unsullied by it, like a lotus unsullied by water.

source: །འཇིག་རྟེན་སྣང་བ་རྣམ་པར་གཟིགས་པ་སྤྱན་གསུམ་མངའ་བ་འཇིག་རྟེན་བདེ་བ་སྦྱིན་མཛད་པ།
en: You see with your three eyes—Light of the World, you bring joy.

source: །འཇིག་རྟེན་ཉི་མ་རྐྱེན་ལ་མཁས་པ་འཇིག་རྟེན་གཙོ་བོ་ཁྱོད་ལ་དེ་རིང་བདག་ཕྱག་འཚལ།
en: O Sun of the World, you understand conditions. Foremost in the world, today we honor you!

source: །དུལ་ཞིང་དུལ་བས་ཡོངས་བསྐོར་སྟོབས་བཅུ་མངའ་བ་སྦྱིན་པ་རྣམས་དང་དུལ་བ་རྣམས་ཀྱིས་འཕགས།
en: “Gentle and disciplined, you mastered the ten powers and perfected generosity and discipline.

source: །འདྲེན་པ་ཉོན་མོངས་རྡུལ་དང་མུན་པ་དང་ནི་དྲི་མ་ཐ་བ་བསྲེགས་ཤིང་མྱུ་གུ་བསྲེགས།
en: Guide, you burned all the dust, darkness, stains, and roughness of the afflictions, incinerating their sprouts.

source: །སྙིང་རྗེས་ནོར་གྱི་གཙོ་བོ་བདུན་པོ་སྦྱིན་པར་མཛད་ཅིང་སེམས་ཅན་རྣམས་ལ་བྱམས་པས་འཕགས།
en: Compassionately, you bestow the seven highest riches, and your love for beings is exalted.

source: །བསོད་ནམས་ཞིང་སྟེ་འཇིག་རྟེན་རྩ་ལག་བརྟན་པོ་ཁྱོད་ལ་བདག་ནི་མགོ་བོས་ཕྱག་འཚལ་ལོ།
en: To you, a field of merit, the world’s best friend, I bow my head.

source: །ཁྱོད་ཀྱི་ཞལ་གྱི་སྨིན་མཚམས་མཛོད་སྤུ་འབར་བ་མེ་ཏོག་ཀུན་ད་ཟླ་བ་དུང་མདོག་འདྲ།
en: “The shining ūrṇā hair by your eyebrows is white like jasmine flowers, the moon, or a conch.

source: །འདི་ན་ཚངས་པའི་གནས་ན་འཁོད་པའི་ལྷ་རྣམས་ཀྱིས་ཀྱང་ཁྱོད་ཀྱི་སྤྱི་གཙུག་མཐོང་མི་འགྱུར།
en: Even the gods from the abodes of Brahmā cannot see your uṣṇīṣa.

source: །ཟླ་བ་ལྟ་བུའི་ཞལ་ནས་བྱུང་བའི་རྨད་བྱུང་འོད་ཀྱིས་འགྲོ་བ་མ་ལུས་སྣང་བར་མཛད།
en: From your moon-like face, miraculous light shines, illuminating all beings without exception.

source: །དེ་ཡིས་རེག་པར་གྱུར་པའི་དབང་གིས་མཚམས་མེད་སེམས་ཅན་རྣམས་ཀྱང་བདེ་བ་ཉིད་དུ་གྱུར།
en: Its touch has the capacity to bring bliss, even to beings who have committed inexpiable evil deeds.

source: །ཁྱོད་ཀྱི་གསུང་ནི་ཤིན་ཏུ་ཡིད་འོང་ཚིག་སྟེ་ཟླ་བ་བཞིན་དུ་ཡིད་ཀྱང་ཚིམ་པར་བགྱིད།
en: “Your speech is so captivating; like the moon your words satisfy the mind—

source: །ལྷ་དང་མི་ཡི་སྒྲ་སྐད་ཟིལ་གྱིས་གནོན་ཅིང་གཅིག་ཏུ་ངེས་པར་དག་ལ་གཙང་བ་སྟེ།
en: Outshining the speech of gods and humans, it is absolutely pure and pristine.

source: །འདོད་ཆགས་ཞེ་སྡང་མུན་པ་རྡུལ་རྣམས་རབ་ཏུ་ཞི་བར་བགྱིད་ཅིང་ཤེས་རབ་གསལ་བར་བགྱིད།
en: You clear the darkening dust of attachment and aggression and illuminate insight.

source: །དགའ་དང་མགུ་བགྱིད་བདེ་བ་ཤིན་ཏུ་སྐྱེད་པར་བགྱིད་ཅིང་ཐར་པ་ཡང་དག་སྟོན་པ་ལགས།
en: You please and delight, cause happiness, and are the true teacher of freedom.

source: །ཁྱོད་ཀྱི་ཡེ་ཤེས་དུས་གསུམ་གཏོགས་པ་ཐོགས་པ་མ་མཆིས་གར་ཡང་ཆགས་པ་མ་མཆིས་ཏེ།
en: “Your wisdom encompasses the three times—it is unimpeded and unstained.

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་ཆུང་དང་འབྲིང་དང་དམ་པ་མ་ལུས་ཐུགས་སུ་ཆུད།
en: You know all the actions of beings—be they humble, middling, or sublime.

source: །གང་དག་གི་ནི་དབང་པོ་བསམ་པ་དག་དང་འགྲོ་དང་ཐར་པ་ཐ་དད་ཇི་འདྲ་བ།
en: You know all the different faculties, thoughts, destinations, and freedoms

source: །ཐམས་ཅད་ཁྱོད་ཀྱིས་སྐད་ཅིག་ཙམ་གྱིས་ཐུགས་སུ་ཆུད་པར་དེ་སླད་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: In a single instant, and thus I prostrate to you!

source: །རྫོགས་པའི་བྱང་ཆུབ་ཤིང་རྒྱལ་དྲུང་དུ་གླགས་ལྟའི་ཕྱིར་བརྩོན་བདུད་རྣམས་བྱེ་བ་བརྒྱ་ཕྲག་སྙེད།
en: “Trillions of persistent māras came to the tree of perfect awakening seeking to do you harm.

source: །ཁྱོད་ཀྱི་ཐད་དུ་ལྷགས་པར་གྱུར་ཀྱང་གནས་ལས་མ་གཡོས་ཐུགས་བརྩེར་ལྡན་པའི་བློ་མངའ་བ།
en: Though they were right before you, you never wavered, and your heart was filled with love.

source: །མངའ་བདག་ཁྱོད་ཀྱིས་བདེན་དང་བརྟུལ་ཞུགས་དཔལ་དང་ཡོན་ཏན་རྣམས་དང་བྱམས་པས་ཕམ་པར་མཛད།
en: O lord, you defeated them with truth, discipline, glory, qualities, and love.

source: །དེ་སླད་མི་རྣམས་སུ་ཞིག་དེང་འདིར་ཁྱོད་ལ་མཆོད་པའི་སླད་དུ་ཁྱོད་ལ་ངོམས་པར་འཛིན།
en: Thus everyone here today has come to venerate you and pay homage.

source: །མངའ་བདག་ཁྱོད་ཀྱིས་ཆོས་རྣམས་བྱེད་པ་མེད་དང་ཡ་མ་བརླ་དང་ཟླ་བ་འདྲ་བ་དང་། །དབུ་བ་གློག་སྤྲིན་ཆུ་ཡི་ཆུ་བུར་འདྲ་ཞིང་སྒྱུ་མ་སྨིག་རྒྱུ་ལྟ་བུར་ཐུགས་སུ་ཆུད།
en: “Lord, you have realized that all things are uncreated and hollow, like a moon reflected in water, Foam, lightning, a cloud, or a water bubble, like illusions or a mirage.

source: །གང་ལ་རྒྱུ་མེད་རྟོག་པ་མི་འབྱུང་ཁྱོད་ཀྱིས་ཆོས་དེ་དག་ནི་རྟག་ཏུ་བདག་མེད་དེ།
en: Your qualities, causeless and inconceivable, are forever devoid of self.

source: །དེ་ལྟར་འགྲོ་བའི་འདོད་པ་ལྔ་སྐྱེད་མཛད་པས་མངའ་བདག་ཁྱོད་ནི་ཐར་པ་ལགས་པར་འོས།
en: You grant the five sense pleasures to beings, and so you, Lord, are able to liberate. “Your amazing and great aspirations, O guide,

source: །གང་གི་དོན་དུ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོར་དཀའ་བ་རྣམས་ནི་བསྟན་པ་དང་། །གང་གི་དོན་དུ་རྟག་ཏུ་འགྲོ་ལ་ཕན་མཛད་འདྲེན་པ་རྣམས་ལ་མཆོད་པ་མཛད་པ་དང་། །གང་གི་དོན་དུ་སྦྱིན་དང་ཡང་དག་སྡོམ་དང་དུལ་དང་བཟོད་པ་རྟག་ཏུ་བསྟེན་པ་ཡི། །རྣམ་འདྲེན་ཁྱོད་ཀྱི་སྨོན་ལམ་ཆེན་པོ་ཤིན་ཏུ་རྨད་དུ་བྱུང་བ་དེ་ནི་རྫོགས་པར་གྱུར།
en: For the sake of which you showed such tenacity throughout trillions of eons, For the sake of which you consistently benefit beings and venerate your guides, For the sake of which you trained in giving, restraint, discipline, and patience, have been fulfilled.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཕྱོགས་འགའ་ཞིག་ཞུ་བར་འཚལ་ལོ།
en: Once Nāga King Sāgara had thus praised the Blessed One with these fitting verses, he said to the Blessed One, “If, to clarify my questions, the blessed, thus-gone, worthy, perfect and complete Buddha would permit me, I would like to ask him about a few issues.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དེ་བཞིན་གཤེགས་པ་ལ་དྲིས་ཤིག་དང་། ངས་དྲི་བ་དྲིས་པ་དེ་དང་དེ་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ།
en: The Blessed One replied to Nāga King Sāgara, “Nāga Lord, ask the Blessed One whatever you desire.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དྲི་བ་ལུང་བསྟན་པའི་སྐབས་ཕྱེ་ནས།
en: May my answers please you.”

source: བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Given the opportunity to have his questions answered by the Blessed One, Nāga King Sāgara then asked the Blessed One, “Blessed One, how do bodhisattvas eliminate rebirth in the lower realms and painful transmigrations?

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ངན་འགྲོ་དང་ངན་སོང་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ་དང་། མི་ཁོམ་པ་བརྒྱད་ལས་འདས་པ་དང་། ལྷ་དང་མིའི་སྐྱེ་བར་འགྲོ་བ་ལགས།
en: How do they transcend the eight unfavorable conditions? How do they take human and divine births?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སངས་རྒྱས་མཐོང་བ་ཐོབ་པ་དང་། དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པ་དང་། འཚམ་པའི་ཡུལ་དུ་གནས་པ་འཐོབ་པ་ལགས།
en: Blessed One, how do bodhisattvas attain an unceasing vision of the buddhas? How do they continuously meet spiritual friends? How do they always find agreeable places to stay?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དད་པ་དང་། དང་བའི་ཤས་ཆེ་བ་དང་། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་རྟོན་པ་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་ནས་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་འབོགས་པ་ལགས།
en: Blessed One, how do bodhisattvas have faith and abundant joy? How do they rely on the ripening of karma? How do they instruct by means of all virtuous qualities, having abandoned all nonvirtuous qualities?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་འཚལ་བ་དང་། ཆོས་ཀྱི་ཀུན་དགའ་ལ་དགའ་བས་དགའ་བ་དང་། ཐོས་པ་ཚོལ་བས་ཆོ་ག་མ་འཚལ་བ་དང་། ཐོས་པ་བསྒྲུབས་པས་མངོན་པར་འཕགས་པ་ལགས།
en: Blessed One, how do bodhisattvas take interest in the Dharma, desire it, and find great delight in it? How are they insatiable in the pursuit of learning? How are they exalted in their accomplishment of learning?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རབ་ཏུ་འབྱུང་བ་ལ་མོས་པ་དང་། ནགས་དང་། ནགས་འདབ་ན་རྒྱུ་བ་དང་། འཕགས་པའི་རིགས་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་ལ་མངོན་པར་དགའ་བ་དང་། རབ་ཏུ་བྱུང་བའི་ཡོན་ཏན་རྣམས་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་ལགས།
en: Blessed One, how are bodhisattvas inspired to go forth? How do they travel through jungles and forests? How are they inspired by those of noble lineage, ascetic practices, and having few possessions? How do they perfect the qualities of going forth?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཟབ་མོའི་ཚུལ་ལ་གནས་པ་དང་། ཆད་པ་དང་རྟག་པར་ལྟ་བ་ཡོངས་སུ་སྤངས་པ་དང་། རྒྱུ་དང་རྐྱེན་གྱི་ཆོས་རྣམས་ལ་ཞུགས་པ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་དང་བྲལ་བ་ལགས།
en: Blessed One, how do bodhisattvas adhere to the profound Dharma? How do they eliminate the views of eternalism and nihilism? How do they engage with causal and conditioned phenomena? How do they become free from all sorts of views?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རྩེ་བ་དང་། སྒྲིབ་པ་མ་མཆིས་པའི་ཡེ་ཤེས་མཐོང་བ་ལགས།
en: Blessed One, how do bodhisattvas play by means of the wisdom of the higher knowledges and see with unobscured wisdom?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་གྱི་སྤྱོད་པ་དང་། བསམ་པ་དང་། ཆོ་ག་འཚལ་བ་ལགས།
en: Blessed One, how do bodhisattvas comprehend the conduct, intentions, and actions of beings?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། གཟུང་བ་དང་། བཀླག་པ་དང་། བརྡ་སྤྲོད་པ་ལ་མཁས་པ་ལགས།
en: Blessed One, how do bodhisattvas bring about ripening? How are they skilled in retention, recitation, and explanation?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ་དང་། སྐྲག་པ་དང་། འཇིགས་པ་ཐམས་ཅད་དང་བྲལ་ནས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ལགས།
en: Blessed One, how do bodhisattvas defeat opposition from māras? How do they live free of fear and anxiety, and how do they live the bodhisattva way of life?
